conf/src/InformationRegisters/ЭП_ПодстатусыТехническихПроектов/ЭП_ПодстатусыТехническихПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ПодстатусыТехническихПроектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Подстатус</name>
    <type>
      <types>EnumRef.ЭП_Подстатусы</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ТехПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ПодстатусыТехническихПроектов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Подстатус") Тогда
		Запись.Подстатус = Параметры.Подстатус;
	КонецЕсли;         
	
	Если Параметры.Свойство("ТехПроект") Тогда
		Запись.ТехПроект = Параметры.ТехПроект;
	КонецЕсли;
	
	Запись.Пользователь = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Подстатус) Тогда
		СтруктураЗакрытия = Новый Структура("Подстатус", Запись.Подстатус);
		Закрыть(СтруктураЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Запись.Период = ПолучитьТекущуюДатуСеанса();
КонецПроцедуры

Функция ПолучитьТекущуюДатуСеанса()
	
	Дата = ТекущаяДатаСеанса();
	Возврат Дата;
	
КонецФункции
